public_html/ADRC/24.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="it" xml:lang="it">
<head>
<!-- 2022-02-03 gio 00:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ADRC - Lesson 24</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Alessandro Straziota" />
<link rel="stylesheet" href="/appunti.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">ADRC - Lesson 24</h1>
<div id="table-of-contents">
<h2>Indice</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3cad4a8">Combinatorial Auction</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3cad4a8" class="outline-2">
<h2 id="org3cad4a8">Combinatorial Auction</h2>
<div class="outline-text-2" id="text-org3cad4a8">
<p>
Nella <a href="./22.html">lezione 22</a> abbiamo visto il gioco dell'<i>Asta a Singolo Oggetto</i>, in cui ogni player vuole comprare l'oggetto all'asta.
Ogni player \(i\) ha una volutazione privata \(t_i\) dell'oggetto, e fa un'offerta \(r_i\) per cercare di vincere l'asta.
Se \(i\) vince allora dovrà pagare un prezzo \(p_i\), ottenendo quindi un'<i>utilità</i> pari a \(u_i = t_i - p_i\).
Abbiamo anche visto che questo è un <b>problema utilitario</b> e che quindi è sempre possibile definire un <i>meccanismo truthful</i>
che induca tutti i player a dichiarere il prorpio tipo privato \(t_i\).<br />
</p>

<p>
Il gioco dell' <b>Asta Combinatorica</b>, o <b>Combinatorial Auction</b> (in breve <code>CA</code>), è una <i>generalizzazione</i> dell'asta a singolo oggetto.
</p>

<p>
Abbiamo un'insieme di \(n\) acquirenti/player e \(m\) oggetti all'asta.
Ogni player \(i\) desidera ottenere un sottoinsieme \(S_i \subseteq \lbrace 1, ..., m \rbrace\) degli oggitti all'asta, è come <i>tipo privato</i>
ha la stima \(t_i\) di quanto vale l'insieme \(S_i\).<br />
</p>

<p>
Si desidera identificare un sottoinsieme \(W \subseteq \lbrace 1, ..., n \rbrace\) di vincitori, ognuno dei quali non va in conflitto con gli
oggetti desiderati dagli altri, ovvero
\[
  \forall i,j \in W : i \neq j \left[ S_i \cap S_j \equiv \emptyset \right]
  \]
</p>

<p>
Come nell'asta singola, si desidera <b>massimizzare</b> il <i>valore</i> di \(W\), ovvero la somma di tutti i tipi privati \(\sum_{i \in W} t_i\).<br />
</p>

<p>
Se un player \(i\) vince, allora avrebbe un guadagno pari al valore che lui stima per \(S_i\).
Più formalmente la <b>valutazione</b> \(v_i\) di ogni player sarà
\[
  v_i(t_i, W) = \begin{cases}
    t_i &\mbox{se } i \in W\\
    0 &\mbox{altrimenti}
  \end{cases}
  \;\; \forall W \in F
  \]
È facile a questo punto osservare che anche l'asta combinatorica è un gioco <i>utilitario</i>.
\[
  \sum_{i \in W} t_i = \sum_{i = 1}^{n} v_i(t_i, W) \;\;\; \forall W \subseteq \left[ n \right]
  \]
</p>

<p>
A questo punto basterà applicare il meccanismo <code>VCG</code>:
\[ g(r) = arg \max_{W \subseteq \left[ n \right]} \sum_{i = 1}^{n} v_i(t_i, W) \]
\[ p_i(r) = \sum_{j \neq i} v_j(r_j, g(r_{-i})) - \sum_{j \neq i} v_j(r_j, g(r)) \]
</p>

<p>
Constatato che il gioco <code>CA</code> è utilitario e che l'algoritmo \(g\) calcola una soluzione ottima, ci si può chiedere quanto è effettivamente complesso
(in termini computazionali) calcolare un outcome di \(g\).
</p>

<blockquote>
<p>
<b>THM</b><br />
Consideriamo il gioco <code>CA</code> con \(m\) oggetti ed \(n\) players.
Approssimare una soluzione ottima calcolata da \(g\) di un fattore <span class="underline">migliore</span> di \(m^{1/2 - \varepsilon}\) è <b>NP-Hard</b>, per ogni costante \(\varepsilon > 0\).
</p>
</blockquote>

<blockquote>
<p>
<b>Proof:</b> Il teorema verrà dimostrato mostrando una riduzione polinomiale dal problema <i>Maximum Independent Set</i> (<code>MAX-IS</code>).
</p>

<p>
Dato un grafo con \(n\) nodi, dal <i>teorema di J.Håstad, 2002</i> sappiamo che approssimare <code>MAX-IS</code> di un fattore migliore \(n^{1-\varepsilon}\) è NP-Hard.<br />
</p>

<p>
Prendiamo un'istanza \(G=(V,E)\) di <code>MAX-IS</code>, e per ogni arco associamo un oggetto all'asta, mentre per ogni nodo associamo un player.
Poniamo poi per ogni player \(i\) l'insieme \(S_i\) pari all'insieme dei suo <i>archi incidenti</i>, e \(t_i = 1\).<br />
</p>

<p>
È possibile dimostrare che un'istanza di <code>CA</code> (ricavata col metodo appena descritto) ha una soluzione di valore \(\geq k\) <span class="underline">se e solo se</span> la relativa istanza
di <code>MAX-IS</code> ha un independent set di dimensione \(\geq k\).<br />
</p>

<dl class="org-dl">
<dt>\(\Rightarrow\)</dt><dd>Supponiamo di avere una soluzione \(W\) di valore \(k\) per l'istanza di <code>CA</code>.
Dato che \(W\) è una soluzione ammissibile, allora per definizione non ci saranno due player \(i, j \in W\) che condivideranno qualche oggetto, ovvero \(S_i cap S_j \equiv \emptyset\).
Però \(S_i\) ed \(S_j\) rappresentano gli archi incidenti ai rispettivi nodi \(i\) e \(j\) dell'instanza di <code>MAX-IS</code>, e visto che non si intersecano allora certamente \(i\) e \(j\) non saranno vicini.
Perciò, dato che il valore di ogni \(S_i\) è pari a \(t_i = 1\), avremo che \(W\) è anche un independent set grande \(k\) per \(G\).<br /></dd>

<dt>\(\Leftarrow\)</dt><dd>Supponiamo ora di avere un independent set \(I\) grande \(k\) per l'istanza \(G\) di <code>MAX-IS</code>.
Per definizione, per ogni coppia di nodi \(i, j \in I\) essi non sono nodo adiacenti, perciò i rispettivi insiemi di archi incidenti non si intersecano.
Dato però che i rispettivi archi incidenti compongono gli insiemi \(S_i\) ed \(S_j\), avremo che \(S_i \cap S_j \equiv \emptyset\).
Perciò \(I\) è anche una soluzione di valore \(k\) per l'istanza di <code>CA</code>.</dd>
</dl>

<p>
Perciò consideriamo una soluzione \(W\) per <code>CA</code> di dimensione \(k\), con \(k\) sufficientemente grande in modo tale da ottenere
\[
  \frac{OPT_{\texttt{CA}}}{k} \leq m^{1/2 - \varepsilon}
  \]
</p>

<p>
Ciò implica che esiste un independent set \(I\) di cardinalità \(k\) tale che
\[
  \frac{OPT_{\texttt{MAX-IS}}}{k} = \frac{OPT_{\texttt{CA}}}{k} \leq m^{1/2 - \varepsilon} \leq n^{1 - 2\varepsilon}
  \]
dove l'ultima uguaglianza è data dal fatto che \(m \leq n^2\).<br />
</p>

<p>
Perciò se avessimo un algoritmo che riesce a calcolare \(W\) in tempo efficiente, allora avremo anche un modo di approssimare <code>MAX-IS</code> in maniera efficiente a un fattore
più piccolo di n<sup>1 - 2&epsilon;</sup> \(\square\).
</p>
</blockquote>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Data: 2022-01-13 gio 00:00</p>
<p class="author">Autore: Alessandro Straziota</p>
<p class="email">Email: <a href="mailto:alessandrostr95@gmail.com">alessandrostr95@gmail.com</a></p>
<p class="date">Created: 2022-02-03 gio 00:33</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
